#include<bits/stdc++.h>
using namespace std;

int n,m,k,t[105],dp[1050000];
//t[i]表示第i包糖中的口味情况,一共有n包糖,n<=100,所以t数组上限105
//dp数组为状态压缩数组,dp[i]表示满足i的二进制表示的口味状态最少要买dp[i]包糖
//eg:dp[5]=2,5=101表示至少买2包糖可以集齐第1和3种口味(对应101)

int main(){
    cin>>n>>m>>k;
    for(int i=1;i<=n;i++){
        for(int j=1;j<=k;j++){
            int a;  cin>>a;  
            a=1<<(a-1);   //将第a种口味转换成二进制(eg:3左移2转换成100)
            t[i]=t[i]|a;  //'|'或运算将k种口味合并(eg:2(10)与3(100)合并为6(110))
                          //最终i的二进制形式中第j位为1就表示有第j种口味的糖
        }
    }
    m=(1<<m)-1;  //最终集齐m种口味的情况对应的二进制状态为m个1
    for(int i=1;i<=m;i++)  dp[i]=105;  
    //初始化dp为较大数,因为最多100包糖,dp表示满足情况的最少包数,所以可以初始化为105
    for(int i=0;i<=m;i++){      //状态转移(刷表法):遍历所有可能的口味状态
        for(int j=1;j<=n;j++){  //遍历每一包糖果,尝试用这包糖果更新状态
            dp[i|t[j]]=min(dp[i|t[j]],dp[i]+1);
            //新状态=当前状态i合并第j包的口味状态t[j](或运算实现合并)
            //新状态的最少包数dp=min(原有值,之前状态包数dp[i]+1(购买第j包))
        }
    }
    if(dp[m]!=105)  cout<<dp[m]<<endl;  //目标状态可以满足则输出最小包数
    else  cout<<-1<<endl;               //不能输出-1
    return 0;
}